In [88]:
from selenium.common.exceptions import NoSuchElementException, ElementClickInterceptedException
from selenium import webdriver
import time
import pandas as pd
import numpy as np
import re
from nltk.corpus import stopwords
import matplotlib.pyplot as plt
from sklearn.base import BaseEstimator, TransformerMixin
from sklearn.model_selection import train_test_split
from sklearn.pipeline import Pipeline
from sklearn.feature_extraction.text import TfidfVectorizer
from sklearn.preprocessing import StandardScaler
from sklearn.pipeline import FeatureUnion
from sklearn.ensemble import RandomForestClassifier
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import confusion_matrix
stopWords = set(stopwords.words('english'))

In [89]:
df1 = pd.read_csv('Project 4 files/Resources/cpj_salary_location_cleaned.csv')

In [90]:
df1=df1[["Job Title","Location","Mean_Salary","Description","Category","Skills","Tools","state"]]
df1=df1.dropna()
df1=df1.drop_duplicates()
df1=df1[df1["Mean_Salary"]!=0]
df1

,Job Title,Location,Mean_Salary,Description,Category,Skills,Tools,state
2,Junior Data Analyst,"Louisville, KY 40223",35750,Basic Function: Develop and process targeted m...,Data Analyst,Data Analysis,"SQL, R, Excel",KY
4,Marketing Data Analyst,"Sarasota, FL 34211",42500,Mercedes Scientific is a national leader in th...,Data Analyst,,R,FL
7,Power BI/Data Analyst,"Dallas-Fort Worth, TX•Temporarily Remote",95000,About our TeamThe Ethos Group IT team consists...,Data Analyst,Statistics,"SQL, R, Excel, Power BI, Tableau",TX
9,Online Data Analyst - USA,"Annapolis, MD•Remote",14500,Company Info: We help companies test and impro...,Data Analyst,,"R, AI, Machine Learning",MD
10,Online Data Analyst - USA,"New Orleans, LA•Remote",14500,Company Info: We help companies test and impro...,Data Analyst,,"R, AI, Machine Learning",LA
...,...,...,...,...,...,...,...,...
15646,Full Stack Developer (REMOTE),"Tampa, FL 33601•Remote",47500,Join us as we pursue our mission to remove the...,Business Intelligence Developer,,"Python, Spark, JavaScript, R, Cloud, HTML, CSS...",FL
15668,Data Analyst II Database developer II Entry le...,"Poway, CA•Temporarily Remote",65000,SQL Developer (Training)Responsibilities· Help...,Business Intelligence Developer,ETL,"SQL, R, Power BI, Tableau",CA
15671,Workday Business Intelligence Developer,"Las Vegas, NV 89119 (Paradise area)",80000,Workday Business Intelligence Developer\nThank...,Business Intelligence Developer,,"R, Cloud, Excel, Java",NV
15689,Data Developer,"Research Triangle Park, NC 27709",52011,TITLE: IT Data Analytics/Data Developer 1\nDut...,Business Intelligence Developer,,"SQL, R, Power BI, Tableau, Scala",NC
15697,BI Developer,"San Jose, CA",135000,Business Intelligence Developer\n\nMultiple Po...,Business Intelligence Developer,"Data Mining, Statistics","Python, SQL, R, Excel, Tableau",CA

In [91]:
# Python
df1['Python'] = df1['Tools'].apply(lambda x: 1 if 'python' in x.lower() else 0)

# R studio 
df1['R'] = df1['Tools'].apply(lambda x: 1 if 'r studio' in x.lower() or 'r-studio' in x.lower() else 0)

# SQL 
df1['SQL'] = df1['Tools'].apply(lambda x: 1 if 'sql' in x.lower() else 0)

# AWS 
df1['AWS'] = df1['Tools'].apply(lambda x: 1 if 'aws' in x.lower() else 0)

# Excel
df1['Excel'] = df1['Tools'].apply(lambda x: 1 if 'excel' in x.lower() else 0)

# Google Cloud
df1['GCP'] = df1['Tools'].apply(lambda x: 1 if 'google cloud' in x.lower() or 'gcp' in x.lower() else 0)

# Microsoft Azure
df1['Azure'] = df1['Tools'].apply(lambda x: 1 if 'microsoft azure' in x.lower() or 'azure' in x.lower() else 0)

# Spark
df1['Spark'] = df1['Tools'].apply(lambda x: 1 if 'spark' in x.lower() else 0)

# Tableau
df1['Tableau'] = df1['Tools'].apply(lambda x: 1 if 'tableau' in x.lower() else 0)

# Keras
df1['Keras'] = df1['Tools'].apply(lambda x: 1 if 'keras' in x.lower() else 0)

#NoSQL
df1['NoSQL'] = df1['Tools'].apply(lambda x: 1 if 'nosql' in x.lower() else 0)

#Machine Learning
df1['Machine_Learning'] = df1['Tools'].apply(lambda x: 1 if 'machine learning' in x.lower() else 0)

#Hadoop
df1['Hadoop'] = df1['Tools'].apply(lambda x: 1 if 'hadoop' in x.lower() else 0)

df1['AI'] = df1['Tools'].apply(lambda x: 1 if 'ai' in x.lower() else 0)

df1['Power_BI'] = df1['Tools'].apply(lambda x: 1 if 'power bi' in x.lower() else 0)

In [92]:
df1=df1.drop(["Skills","Tools"],axis=1)

In [93]:
# Classifying job levels into each category
def seniority(title):
    if 'sr' in title.lower() or 'senior' in title.lower() or 'vp' in title.lower() or 'lead' in title.lower() or 'principal' in title.lower()or 'experienced' in title.lower() or 'iii' in title.lower() or 'research' in title.lower() or 'manager' in title.lower():
        return 'Senior'
    elif 'intermediate' in title.lower() or 'staff' in title.lower() or 'ii' in title.lower():
        return 'Mid'
    elif 'jr' in title.lower() or 'junior' in title.lower() or 'intern' in title.lower() or 'student' in title.lower()or 'associate' in title.lower():
        return 'Junior'
    else:
        return 'Not Specified'

In [94]:
df1['Seniority'] = df1['Job Title'].apply(seniority)
# Categorize salary
def salary_category(salary):
    if salary<5000:
        return 0
    if 50000 <= salary < 75000:
        return 1
    if 75000 <= salary < 100000:
        return 2
    if 100000 <= salary < 125000:
        return 3
    if 125000 <= salary < 150000:
        return 4
    if 150000 <= salary < 175000:
        return 5
    if 175000 <= salary < 200000:
        return 6
    else:
        return 7
target = df1['Mean_Salary'].apply(salary_category)
len(target)

1781

In [95]:
df1=df1.drop("Location",axis=1)

In [96]:
df1

,Job Title,Mean_Salary,Description,Category,state,Python,R,SQL,AWS,Excel,...,Azure,Spark,Tableau,Keras,NoSQL,Machine_Learning,Hadoop,AI,Power_BI,Seniority
2,Junior Data Analyst,35750,Basic Function: Develop and process targeted m...,Data Analyst,KY,0,0,1,0,1,...,0,0,0,0,0,0,0,0,0,Junior
4,Marketing Data Analyst,42500,Mercedes Scientific is a national leader in th...,Data Analyst,FL,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,Not Specified
7,Power BI/Data Analyst,95000,About our TeamThe Ethos Group IT team consists...,Data Analyst,TX,0,0,1,0,1,...,0,0,1,0,0,0,0,0,1,Not Specified
9,Online Data Analyst - USA,14500,Company Info: We help companies test and impro...,Data Analyst,MD,0,0,0,0,0,...,0,0,0,0,0,1,0,1,0,Not Specified
10,Online Data Analyst - USA,14500,Company Info: We help companies test and impro...,Data Analyst,LA,0,0,0,0,0,...,0,0,0,0,0,1,0,1,0,Not Specified
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
15646,Full Stack Developer (REMOTE),47500,Join us as we pursue our mission to remove the...,Business Intelligence Developer,FL,1,0,0,0,1,...,0,1,0,0,0,0,1,0,0,Not Specified
15668,Data Analyst II Database developer II Entry le...,65000,SQL Developer (Training)Responsibilities· Help...,Business Intelligence Developer,CA,0,0,1,0,0,...,0,0,1,0,0,0,0,0,1,Mid
15671,Workday Business Intelligence Developer,80000,Workday Business Intelligence Developer\nThank...,Business Intelligence Developer,NV,0,0,0,0,1,...,0,0,0,0,0,0,0,0,0,Not Specified
15689,Data Developer,52011,TITLE: IT Data Analytics/Data Developer 1\nDut...,Business Intelligence Developer,NC,0,0,1,0,0,...,0,0,1,0,0,0,0,0,1,Not Specified
15697,BI Developer,135000,Business Intelligence Developer\n\nMultiple Po...,Business Intelligence Developer,CA,1,0,1,0,1,...,0,0,1,0,0,0,0,0,0,Not Specified

In [97]:
df1['Description'] = df1['Description'].apply(lambda x: ' '.join(x.split()))
df1['Description'] = df1['Description'].apply(lambda x: re.sub(r'[^\w\s]','', x.lower()))
df1['Description'] = df1['Description'].apply(lambda x: ' '.join([word for word in x.split() if word not in stopWords]))

In [98]:
df1

,Job Title,Mean_Salary,Description,Category,state,Python,R,SQL,AWS,Excel,...,Azure,Spark,Tableau,Keras,NoSQL,Machine_Learning,Hadoop,AI,Power_BI,Seniority
2,Junior Data Analyst,35750,basic function develop process targeted mailin...,Data Analyst,KY,0,0,1,0,1,...,0,0,0,0,0,0,0,0,0,Junior
4,Marketing Data Analyst,42500,mercedes scientific national leader distributi...,Data Analyst,FL,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,Not Specified
7,Power BI/Data Analyst,95000,teamthe ethos group team consists members work...,Data Analyst,TX,0,0,1,0,1,...,0,0,1,0,0,0,0,0,1,Not Specified
9,Online Data Analyst - USA,14500,company info help companies test improve machi...,Data Analyst,MD,0,0,0,0,0,...,0,0,0,0,0,1,0,1,0,Not Specified
10,Online Data Analyst - USA,14500,company info help companies test improve machi...,Data Analyst,LA,0,0,0,0,0,...,0,0,0,0,0,1,0,1,0,Not Specified
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
15646,Full Stack Developer (REMOTE),47500,join us pursue mission remove barriers data ac...,Business Intelligence Developer,FL,1,0,0,0,1,...,0,1,0,0,0,0,1,0,0,Not Specified
15668,Data Analyst II Database developer II Entry le...,65000,sql developer trainingresponsibilities help wr...,Business Intelligence Developer,CA,0,0,1,0,0,...,0,0,1,0,0,0,0,0,1,Mid
15671,Workday Business Intelligence Developer,80000,workday business intelligence developer thank ...,Business Intelligence Developer,NV,0,0,0,0,1,...,0,0,0,0,0,0,0,0,0,Not Specified
15689,Data Developer,52011,title data analyticsdata developer 1 duties as...,Business Intelligence Developer,NC,0,0,1,0,0,...,0,0,1,0,0,0,0,0,1,Not Specified
15697,BI Developer,135000,business intelligence developer multiple posit...,Business Intelligence Developer,CA,1,0,1,0,1,...,0,0,1,0,0,0,0,0,0,Not Specified

In [99]:
# Classifying job levels into each category
def seniority(title):
    if 'sr' in title.lower() or 'senior' in title.lower() or 'vp' in title.lower() or 'lead' in title.lower() or 'principal' in title.lower()or 'experienced' in title.lower() or 'iii' in title.lower() or 'research' in title.lower() or 'manager' in title.lower():
        return 'Senior'
    elif 'intermediate' in title.lower() or 'staff' in title.lower() or 'ii' in title.lower():
        return 'Mid'
    elif 'jr' in title.lower() or 'junior' in title.lower() or 'intern' in title.lower() or 'student' in title.lower()or 'associate' in title.lower():
        return 'Junior'
    else:
        return 'Not Specified'

In [100]:
class TextSelector(BaseEstimator, TransformerMixin):
    """
    Transformer to select a single column from the data frame to perform additional transformations on
    Use on text columns in the data
    """
    def __init__(self, key):
        self.key = key

    def fit(self, X, y=None):
        return self

    def transform(self, X):
        return X[self.key]
    
class NumberSelector(BaseEstimator, TransformerMixin):
    """
    Transformer to select a single column from the data frame to perform additional transformations on
    Use on numeric columns in the data
    """
    def __init__(self, key):
        self.key = key

    def fit(self, X, y=None):
        return self

    def transform(self, X):
        return X[[self.key]]

In [101]:
features= df1.drop("Mean_Salary",axis=1)
numeric_features= [c for c in df1.columns.values if c not in ['Job Title','state','Category','Seniority',"Description"]]
print(len(features))
print(len(target))
X_train, X_test, y_train, y_test = train_test_split(features, target, test_size=0.2, random_state=42)
X_train.head(2)

1781
1781

,Job Title,Description,Category,state,Python,R,SQL,AWS,Excel,GCP,Azure,Spark,Tableau,Keras,NoSQL,Machine_Learning,Hadoop,AI,Power_BI,Seniority
924,Data Analyst,job summary functional analyst work within bus...,Data Analyst,TX,0,0,1,0,0,0,0,0,0,0,0,0,0,0,1,Not Specified
4651,Senior Machine Learning Visualization Engineer,machine learning engineer market intelligence ...,Machine Learning Engineer,VA,1,0,1,0,0,0,0,1,0,0,0,1,0,0,0,Senior

In [102]:
# Define text feature pipelines
Job_Title = Pipeline([
                ('selector', TextSelector(key='Job Title')),
                ('tfidf', TfidfVectorizer(stop_words='english'))
            ])


State = Pipeline([
                ('selector', TextSelector(key='state')),
                ('tfidf', TfidfVectorizer(stop_words='english'))
            ])

Category = Pipeline([
                ('selector', TextSelector(key='Category')),
                ('tfidf', TfidfVectorizer(stop_words='english'))
            ])

Seniority = Pipeline([
                ('selector', TextSelector(key='Seniority')),
                ('tfidf', TfidfVectorizer(stop_words='english'))
            ])
Description = Pipeline([
                ('selector', TextSelector(key='Description')),
                ('tfidf', TfidfVectorizer(stop_words='english'))
 ])
Job_Title.fit_transform(X_train)

<1424x617 sparse matrix of type '<class 'numpy.float64'>'
	with 4798 stored elements in Compressed Sparse Row format>

In [103]:
# Define numeric feature pipelines 

Python =  Pipeline([
                ('selector', NumberSelector(key='Python')),
                ('standard', StandardScaler())
            ])
R =  Pipeline([
                ('selector', NumberSelector(key='R')),
                ('standard', StandardScaler()),
            ])
SQL =  Pipeline([
                ('selector', NumberSelector(key='SQL')),
                ('standard', StandardScaler()),
            ])
AWS =  Pipeline([
                ('selector', NumberSelector(key='AWS')),
                ('standard', StandardScaler()),
            ])
Excel =  Pipeline([
                ('selector', NumberSelector(key='Excel')),
                ('standard', StandardScaler()),
            ])
GCP =  Pipeline([
                ('selector', NumberSelector(key='GCP')),
                ('standard', StandardScaler()),
            ])
Azure =  Pipeline([
                ('selector', NumberSelector(key='Azure')),
                ('standard', StandardScaler()),
            ])
Spark =  Pipeline([
                ('selector', NumberSelector(key='Spark')),
                ('standard', StandardScaler()),
            ])

Tableau =  Pipeline([
                ('selector', NumberSelector(key='Tableau')),
                ('standard', StandardScaler()),
            ])
Keras =  Pipeline([
                ('selector', NumberSelector(key='Keras')),
                ('standard', StandardScaler()),
            ])
NoSQL =  Pipeline([
                ('selector', NumberSelector(key='NoSQL')),
                ('standard', StandardScaler()),
            ])

Machine_Learning =  Pipeline([
                ('selector', NumberSelector(key='Machine_Learning')),
                ('standard', StandardScaler()),
            ])
Hadoop =  Pipeline([
                ('selector', NumberSelector(key='Hadoop')),
                ('standard', StandardScaler()),
            ])
AI =  Pipeline([
                ('selector', NumberSelector(key='AI')),
                ('standard', StandardScaler()),
            ])
Power_BI =  Pipeline([
                ('selector', NumberSelector(key='Power_BI')),
                ('standard', StandardScaler()),
            ])

In [104]:
# FeatureUnion for all feature vectors 
feats = FeatureUnion([('Job Title', Job_Title), 
                    ('Description', Description),
                      ('State', State),
                      ('Category', Category),
                      ('Seniority',Seniority),
                      ('Python', Python),
                      ('R', R),
                      ('SQL', SQL),
                      ('AWS', AWS),
                      ('Excel', Excel),
                      ('GCP', GCP),
                      ('Azure', Azure),
                      ('Spark', Spark),
                      ('Tableau', Tableau),
                      ('NoSQL', NoSQL),
                      ('Machine_Learning',Machine_Learning),
                      ('Hadoop', Hadoop),
                      ('AI',AI),
                      ('Power_BI',Power_BI)
                     ])

feature_processing = Pipeline([('feats', feats)])
feature_processing.fit_transform(X_train)

<1424x28188 sparse matrix of type '<class 'numpy.float64'>'
	with 394086 stored elements in Compressed Sparse Row format>

In [105]:
pipeline = Pipeline([
    ('features',feats),
    ('classifier', RandomForestClassifier(random_state = 42)),
])

pipeline.fit(X_train, y_train)

preds = pipeline.predict(X_test)
preds

array([7, 2, 3, 7, 3, 4, 1, 1, 7, 2, 2, 1, 2, 0, 7, 1, 2, 1, 2, 1, 3, 7,
       1, 1, 4, 2, 2, 2, 1, 4, 1, 2, 2, 1, 1, 2, 7, 3, 7, 3, 1, 7, 1, 2,
       1, 1, 2, 1, 3, 2, 3, 3, 2, 2, 7, 1, 1, 1, 2, 2, 2, 2, 2, 7, 2, 2,
       2, 3, 1, 2, 5, 7, 2, 7, 1, 4, 2, 2, 1, 7, 2, 2, 1, 1, 1, 7, 1, 2,
       2, 7, 2, 2, 2, 1, 7, 3, 4, 1, 3, 3, 2, 1, 2, 2, 4, 2, 1, 1, 1, 3,
       7, 1, 1, 3, 1, 1, 1, 4, 2, 4, 1, 4, 7, 1, 1, 2, 7, 2, 1, 6, 7, 1,
       1, 4, 4, 2, 1, 2, 1, 7, 1, 1, 1, 7, 7, 1, 4, 7, 2, 2, 2, 7, 1, 1,
       1, 2, 7, 2, 2, 2, 2, 2, 5, 7, 4, 2, 3, 1, 1, 1, 3, 2, 4, 2, 1, 7,
       4, 1, 1, 2, 1, 2, 2, 3, 2, 1, 7, 2, 2, 1, 2, 5, 1, 4, 1, 7, 1, 2,
       1, 3, 3, 1, 7, 1, 4, 1, 7, 4, 1, 1, 4, 2, 4, 4, 1, 1, 7, 1, 1, 5,
       2, 2, 3, 1, 2, 3, 2, 2, 1, 2, 1, 6, 2, 2, 4, 7, 2, 2, 2, 7, 1, 2,
       1, 7, 3, 0, 1, 3, 1, 2, 7, 1, 1, 1, 2, 1, 3, 2, 1, 2, 1, 3, 1, 6,
       2, 1, 3, 2, 1, 2, 1, 4, 1, 7, 2, 2, 1, 1, 5, 7, 2, 2, 1, 2, 7, 1,
       4, 1, 2, 4, 7, 2, 3, 2, 1, 3, 2, 1, 1, 1, 2, 1, 3, 3, 4, 2, 3, 3,
       1, 1, 1, 0, 7, 2, 3, 1, 4, 1, 2, 1, 3, 1, 1, 2, 7, 2, 2, 4, 2, 2,
       2, 2, 1, 4, 1, 7, 2, 1, 1, 3, 2, 1, 2, 2, 4, 2, 2, 1, 7, 7, 1, 1,
       2, 2, 4, 2, 5], dtype=int64)

In [106]:
# Define a custom accuracy evaluation function 
def evaluate(preds, y_test, variation):
    counter = 0
    for i in range(len(preds)):
        if y_test[i]-variation <= preds[i] <= y_test[i]+variation:
            counter += 1
        else: 
            counter += 0
    accuracy = counter / len(preds) 
    return accuracy
        
evaluate(list(preds), list(y_test), 1)

0.6498599439775911

In [107]:
from sklearn.model_selection import GridSearchCV
model =  RandomForestClassifier()
param_grid = {'max_depth': [3, 5, 10],
         'min_samples_split': [2, 5, 10]}
grid_search = GridSearchCV(model, param_grid=param_grid)

In [108]:
df2=pd.get_dummies(df1)

X_train, X_test, y_train, y_test = train_test_split(df2, target, test_size=0.2, random_state=42)
X_train.head(2)
grid_search.fit(X_train, y_train)

GridSearchCV(estimator=RandomForestClassifier(),
             param_grid={'max_depth': [3, 5, 10],
                         'min_samples_split': [2, 5, 10]})

In [109]:
preds=grid_search.predict(X_test)
preds

array([1, 1, 1, 1, 2, 1, 1, 2, 1, 2, 1, 2, 2, 1, 2, 2, 1, 2, 1, 2, 2, 1,
       2, 2, 3, 2, 2, 2, 1, 1, 1, 1, 1, 1, 1, 2, 1, 2, 2, 3, 2, 1, 2, 2,
       1, 1, 2, 1, 2, 1, 3, 2, 2, 2, 2, 1, 3, 1, 2, 1, 2, 2, 2, 2, 1, 1,
       2, 2, 2, 2, 4, 2, 2, 2, 2, 1, 2, 1, 1, 2, 2, 1, 2, 1, 1, 1, 1, 1,
       2, 1, 2, 2, 2, 1, 1, 2, 2, 2, 2, 3, 2, 1, 2, 2, 4, 1, 1, 2, 2, 2,
       7, 2, 1, 3, 1, 1, 2, 2, 2, 2, 2, 1, 1, 1, 1, 2, 7, 1, 1, 1, 7, 2,
       1, 1, 4, 1, 1, 2, 1, 2, 2, 1, 1, 2, 1, 1, 1, 2, 1, 2, 2, 7, 1, 1,
       1, 2, 1, 1, 2, 2, 2, 2, 1, 2, 2, 2, 2, 1, 1, 2, 3, 2, 2, 2, 2, 1,
       4, 1, 2, 1, 1, 1, 2, 2, 2, 2, 2, 2, 1, 2, 2, 2, 1, 1, 2, 1, 1, 1,
       2, 2, 1, 1, 1, 1, 1, 1, 3, 1, 1, 2, 2, 2, 1, 2, 1, 1, 7, 1, 1, 2,
       2, 2, 2, 1, 2, 1, 2, 2, 1, 2, 2, 1, 2, 2, 2, 1, 2, 1, 2, 2, 2, 2,
       1, 2, 3, 1, 1, 2, 1, 1, 7, 2, 1, 1, 1, 1, 1, 2, 1, 1, 2, 1, 1, 1,
       2, 1, 3, 1, 2, 1, 1, 2, 1, 1, 2, 1, 1, 2, 2, 7, 2, 1, 2, 2, 1, 2,
       2, 1, 2, 2, 1, 2, 2, 1, 2, 3, 2, 1, 1, 1, 2, 1, 2, 3, 1, 2, 1, 2,
       2, 1, 3, 1, 2, 1, 2, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 1, 2, 2,
       2, 2, 2, 2, 2, 1, 1, 1, 2, 3, 1, 2, 1, 2, 1, 1, 2, 1, 1, 2, 1, 1,
       2, 2, 1, 2, 2], dtype=int64)

In [110]:
def evaluate(preds, y_test, variation):
    counter = 0
    for i in range(len(preds)):
        if y_test[i]-variation <= preds[i] <= y_test[i]+variation:
            counter += 1
        else: 
            counter += 0
    accuracy = counter / len(preds) 
    return accuracy
        
evaluate(list(preds), list(y_test), 1)

0.6890756302521008

In [111]:
import pickle
with open('salary_predict_model.h5', 'wb') as file:
    pickle.dump(pipeline, file)